; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v3 ?v8)
             (pred_8 ?v7 ?v5)
             (pred_4 ?v3 ?v5)
             (pred_5 ?v10 ?v3 )
	     (pred_6 ?v3)
             (pred_10 ?v4)
             (pred_7 ?v7)
             (pred_12 ?v5)
             (pred_1 ?v3)
             (pred_2 ?v7)
             (pred_9 ?v3)
             (pred_11 ))



(:action op_1
:parameters (?v11 ?v1 ?v6 ?v2)
:precondition (and (pred_10 ?v11) (pred_10 ?v1) (pred_7 ?v6) (pred_12 ?v2)
          (pred_3 ?v11 ?v1) (pred_8 ?v6 ?v2)
                   (pred_4 ?v1 ?v2) (pred_6 ?v11) 
                   (pred_1 ?v1) (pred_2 ?v6))
:effect (and  (pred_9 ?v1) (not (pred_1 ?v1))))


(:action op_5
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_10 ?v9)
               (pred_6 ?v11) (pred_3 ?v11 ?v9) (pred_9 ?v9))
:effect (and (pred_6 ?v9) (not (pred_6 ?v11))))

(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_10 ?v11) (pred_7 ?v6) 
                  (pred_6 ?v11) (pred_5 ?v6 ?v11) (pred_11 ))
:effect (and (pred_2 ?v6)
   (not (pred_5 ?v6 ?v11)) (not (pred_11 ))))


(:action op_2
:parameters (?v11 ?v12 ?v13)
:precondition (and (pred_10 ?v11) (pred_7 ?v12) (pred_7 ?v13)
                  (pred_6 ?v11) (pred_2 ?v13) (pred_5 ?v12 ?v11))
:effect (and (pred_2 ?v12) (pred_5 ?v13 ?v11)
        (not (pred_2 ?v13)) (not (pred_5 ?v12 ?v11))))

(:action op_3
:parameters (?v11 ?v6)
:precondition (and (pred_10 ?v11) (pred_7 ?v6) 
                  (pred_6 ?v11) (pred_2 ?v6))
:effect (and (pred_11 ) (pred_5 ?v6 ?v11) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_13 obj_10 obj_09 obj_12 obj_06 obj_15 obj_01 obj_04 obj_05 obj_19 obj_02 obj_17 obj_18 obj_14 obj_22
    obj_07 obj_20 obj_08
    obj_03 obj_21 obj_16
    )

    (:init
       (pred_11)

       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_05)
       (pred_10 obj_19)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_10 obj_22)
       (pred_12 obj_07)
       (pred_12 obj_20)
       (pred_12 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_21)
       (pred_7 obj_16)

       (pred_3 obj_11 obj_12)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_13 obj_06)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_12 obj_04)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_13)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_12)
       (pred_3 obj_05 obj_18)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_02 obj_22)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_18 obj_14)
       (pred_3 obj_18 obj_05)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_14 obj_22)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_18)
       (pred_3 obj_22 obj_02)
       (pred_3 obj_22 obj_14)
       (pred_1 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_4  obj_14 obj_07)
       (pred_4  obj_10 obj_20)
       (pred_4  obj_01 obj_08)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_05)
       (pred_9 obj_19)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_18)
       (pred_9 obj_22)

       (pred_8  obj_03 obj_07)
       (pred_8  obj_21 obj_20)
       (pred_8  obj_16 obj_08)
       (pred_5 obj_03 obj_11)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_16 obj_12)
       (pred_6 obj_02)
    )

    (:goal (and
       (pred_5 obj_03 obj_15)
       (pred_5 obj_16 obj_05)
    ))
(:constraints
  (always (not (pred_6 obj_06)))
)
)

; plan
1. (op_5 obj_02 obj_19)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_19)
   goals met: 0 of 2
2. (op_5 obj_19 obj_05)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_05)
   goals met: 0 of 2
3. (op_5 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 0 of 2
4. (op_5 obj_04 obj_12)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_12)
   goals met: 0 of 2
5. (op_5 obj_12 obj_11)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_11)
   goals met: 0 of 2
6. (op_4 obj_11 obj_03)
   deleted: (pred_5 obj_03 obj_11) (pred_11)
   added: (pred_2 obj_03)
   goals met: 0 of 2
7. (op_5 obj_11 obj_12)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_16 obj_03)
   deleted: (pred_2 obj_03) (pred_5 obj_16 obj_12)
   added: (pred_2 obj_16) (pred_5 obj_03 obj_12)
   goals met: 0 of 2
9. (op_5 obj_12 obj_04)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_04)
   goals met: 0 of 2
10. (op_5 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 0 of 2
11. (op_3 obj_05 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_11) (pred_5 obj_16 obj_05)
   goals met: 1 of 2
12. (op_5 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 1 of 2
13. (op_5 obj_04 obj_12)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_12)
   goals met: 1 of 2
14. (op_4 obj_12 obj_03)
   deleted: (pred_5 obj_03 obj_12) (pred_11)
   added: (pred_2 obj_03)
   goals met: 1 of 2
15. (op_5 obj_12 obj_04)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_04)
   goals met: 1 of 2
16. (op_5 obj_04 obj_05)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_05)
   goals met: 1 of 2
17. (op_5 obj_05 obj_19)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_19)
   goals met: 1 of 2
18. (op_5 obj_19 obj_15)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_15)
   goals met: 1 of 2
19. (op_3 obj_15 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_11) (pred_5 obj_03 obj_15)
   goals met: 2 of 2
